Repository: LittleJianCH/AI-Fitness
Catalog: ios/App/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@ analysis
zh_hans: %@分析

source: %@ and %@
zh_hans: %@与%@

source: %@ over %@
zh_hans: %@随%@变化

source: %@ resting / threshold / maximum heart rate
zh_hans: %@静息 / 阈值 / 最大心率

source: %@ threshold power
zh_hans: %@阈值功率

source: %lld km splits
zh_hans: %lld km 分段

source: %lld workouts · Known load %@
zh_hans: %lld 次运动 · 已知负荷 %@

source: 180 days
zh_hans: 180 天

source: 42 days
zh_hans: 42 天

source: 90 days
zh_hans: 90 天

source: About the data
zh_hans: 数据说明

source: Account
zh_hans: 账号

source: Account and sign-in sessions
zh_hans: 账号与登录会话

source: Account sign-in
zh_hans: 账号登录

source: Add equipment
zh_hans: 添加器材

source: Add heart rate parameters effective at the workout start in Settings
zh_hans: 请在设置中补充该运动开始时生效的心率参数

source: Algorithm
zh_hans: 算法

source: Aligned sample pairs: %lld; the chart shows up to 600 pairs. Correlation does not imply causation.
zh_hans: %lld 对有效采样，图上最多展示 600 对。相关不代表因果。

source: All
zh_hans: 全部

source: All workouts in this range have been imported
zh_hans: 这段历史中的运动均已导入

source: Allow writing the previewed data types in Health permissions.
zh_hans: 请在健康权限中允许写入预览所列的数据类型。

source: Altitude
zh_hans: 海拔

source: Ambient temperature
zh_hans: 环境温度

source: Analysis method and personal parameters
zh_hans: 分析方法与个人参数

source: Analysis was cancelled. Try again.
zh_hans: 分析已取消，请重试。

source: Analyzing workout…
zh_hans: 正在分析运动…

source: Appearance
zh_hans: 外观

source: Apple Health
zh_hans: 苹果健康

source: Apple Health is unavailable on this device.
zh_hans: 此设备不支持苹果健康。

source: Apple Health summary
zh_hans: 苹果健康摘要

source: Apple Health was updated, but the server receipt was not confirmed. Try again.
zh_hans: Apple 健康已写入，但后端回执未能确认，请重试。

source: Ascent
zh_hans: 爬升

source: Assume no training load before the start
zh_hans: 假设开始前没有训练负荷

source: Authorize and read
zh_hans: 授权并读取

source: Average
zh_hans: 平均

source: Average excluding zero plateaus
zh_hans: 排除零平台的平均

source: Average heart rate
zh_hans: 平均心率

source: Average pace
zh_hans: 平均配速

source: Average power
zh_hans: 平均功率

source: Average power / body weight
zh_hans: 平均功率 / 体重

source: Average speed
zh_hans: 平均速度

source: Average temperature
zh_hans: 平均气温

source: Best interval: %@ – %@
zh_hans: 最佳区间：%@ – %@

source: Best sustained power
zh_hans: 最佳持续功率

source: Best sustained power chart. Use the duration picker or data list to inspect values.
zh_hans: 最佳持续功率曲线，使用下方时长选择或数据列表查看数值

source: Bike
zh_hans: 自行车

source: Bike weight
zh_hans: 自行车重量

source: Body weight
zh_hans: 体重

source: Body weight (kg)
zh_hans: 体重 (kg)

source: Body weight used
zh_hans: 使用的体重

source: Both charts share horizontal positions and retain their original units.
zh_hans: 两张图共享横轴位置，各自保留原始单位。

source: Calculate fitness and fatigue
zh_hans: 计算体能与疲劳

source: Calculated results
zh_hans: 计算结果

source: Calculating best sustained power…
zh_hans: 正在计算最佳持续功率…

source: Calculating…
zh_hans: 正在计算…

source: Cancel
zh_hans: 取消

source: Cannot access export recovery records. Unlock this device and check available storage.
zh_hans: 导出恢复记录无法读写，请解锁设备并检查可用空间。

source: Cannot access secure credential storage. Unlock this device and try again.
zh_hans: 无法访问安全凭据存储，请解锁设备后重试。

source: Cannot connect to the server. Check your network and try again.
zh_hans: 暂时无法连接服务器，请检查网络后重试。

source: Change server
zh_hans: 更换服务器

source: Check the form.
zh_hans: 请检查填写内容。

source: Checks up to the latest 200 records in this period. Only single-sport cycling and running are supported; records written by this app are excluded. An empty list may reflect read permissions rather than no workouts.
zh_hans: 最多检查此期间最新的 200 条记录，只支持单项骑行和跑步，并排除本应用回写的记录。空列表可能与读取权限有关，并不代表没有运动。

source: Clear saved credentials
zh_hans: 清除本机凭据

source: Clearing local credentials does not revoke the session on the server.
zh_hans: 清除本机凭据不会撤销服务器上的会话。

source: Close
zh_hans: 关闭

source: Compare metric
zh_hans: 对照指标

source: Complete all heart rate parameters, with resting < threshold ≤ maximum heart rate.
zh_hans: 心率参数请全部填写，并满足：静息心率 < 阈值心率 ≤ 最大心率。

source: Confirm complete workout records and configure heart rate parameters. Training load remains unknown when heart rate sampling is insufficient.
zh_hans: 请确认运动记录完整，并为相关运动设置心率参数。心率采样不足时，训练负荷仍保留未知。

source: Confirm the version and data to export. If interrupted, return here to resume.
zh_hans: 确认要导出的版本和数据。中途中断时，可以回到这里继续恢复。

# Confirm upload (%lld)
source: Confirm upload of %lld workouts
zh_hans: 确认上传以上 %lld 条

source: Confirm write
zh_hans: 确认写入

source: Connect
zh_hans: 连接

source: Connect to a server to view workouts and exchange data with Apple Health.
zh_hans: 连接服务器后，即可查看运动记录并与 Apple 健康交换数据。

source: Connect your workout records
zh_hans: 连接你的训练记录

source: Continuous segment
zh_hans: 连续段

source: Continuous, increasing distance samples are required for splits. Gaps and distance resets are not extrapolated.
zh_hans: 需要连续、递增的距离采样才能计算分段。缺失或距离重置时不推算。

source: Correlation
zh_hans: 相关系数

source: Count: %lld
zh_hans: %lld 个

source: Credentials are stored separately for each server on this device.
zh_hans: 登录凭据会按服务器地址分别保存在本机。

source: Credentials could not be saved and the server session could not be revoked. Unlock this device, try again, and review this session in session management.
zh_hans: 凭据未能保存，且服务器会话未能撤销；请解锁设备后重试，并在会话管理中检查本次会话。

source: Current account
zh_hans: 当前账号

source: Cycling
zh_hans: 骑行

source: Cycling cadence
zh_hans: 踏频

source: Cycling type
zh_hans: 骑行类型

source: Daily load
zh_hans: 每日负荷

source: Dark
zh_hans: 深色

source: Date
zh_hans: 日期

source: Date range
zh_hans: 读取范围

source: Dates use %@. Workouts belong to their start date; today's result updates as new records arrive.
zh_hans: 日期按 %@ 划分。当天的运动计入开始日期；今天的结果会随新记录更新。

source: Days
zh_hans: 天数

source: Derived statistics are unavailable. Return to workout details to retry the analysis.
zh_hans: 派生统计暂不可用，可返回运动详情重试分析。

source: Detailed analysis
zh_hans: 详细分析

source: Device laps
zh_hans: 设备分段

source: Device time zone · %@
zh_hans: 本机时区 · %@

source: Device-recorded laps
zh_hans: 设备记录的分段

source: Display
zh_hans: 显示

source: Distance
zh_hans: 距离

source: Distance (km)
zh_hans: 距离（km）

source: Distance splits
zh_hans: 距离分段

source: Distribution
zh_hans: 分布

source: Done
zh_hans: 完成

source: Duration
zh_hans: 用时

source: Duration in seconds
zh_hans: 持续秒数

source: Each update creates a record with an effective time. Analysis uses workout-recorded parameters first, then personal parameters effective at the workout start.
zh_hans: 每次更新都新增一条带生效时间的记录。分析优先使用运动中的身体参数；缺少时使用运动开始时生效的个人参数。

source: Earlier workouts retain their previous parameters. An earlier effective date applies these parameters to analysis of workouts starting from that time.
zh_hans: 生效时间之前的运动保持原参数。选择较早的时间，会使该时间之后的运动采用这次填写的参数进行分析。

source: Edit equipment
zh_hans: 编辑器材

source: Effective from
zh_hans: 生效时间

source: Efficiency factor
zh_hans: 效率因子

source: Elapsed time
zh_hans: 经过时间

source: Elapsed time (minutes)
zh_hans: 经过时间（分钟）

source: Elevation, energy and environment
zh_hans: 海拔、能量与环境

source: End
zh_hans: 结束

source: End date
zh_hans: 结束日期

source: Ending fatigue ATL
zh_hans: 期末疲劳 ATL

source: Ending fitness CTL
zh_hans: 期末体能 CTL

source: Enter a server address with its protocol and optional port, without a path, query, or account information.
zh_hans: 请输入后端地址，包含协议和可选端口，不包含路径、查询参数或账号。

source: Enter an equipment name of at most 120 characters.
zh_hans: 请填写不超过 120 字的器材名称。

source: Equipment
zh_hans: 器材

source: Equipment name
zh_hans: 器材名称

source: Expand map
zh_hans: 展开地图

source: Export completed
zh_hans: 已完成导出

source: Export preview
zh_hans: 导出预览

source: Export to Apple Health
zh_hans: 导出到 Apple 健康

source: Exports cycling or running, supported recorded samples such as heart rate, power and speed, and route coordinates. Distance and energy use recorded totals without adding cumulative streams again; missing totals are not inferred. Apple Health calculates duration from start, end and pause events, which can differ from the recorded summary. Route accuracy is unknown and is not fabricated; altitude is omitted. Laps, running cadence, notes, tags, calculated summaries and other unsupported fields are omitted. This is a platform copy, not a complete backup. A new revision creates a new copy.
zh_hans: 导出骑行/跑步、记录中的心率/功率/速度等支持的采样，以及路线经纬度。距离和能量使用记录总量，不重复叠加累计曲线；缺失总量不推算。Apple 健康会按起止时间和暂停事件计算时长，可能与记录摘要不同。路线精度未知，不伪造定位精度；海拔不写入。圈、跑步步频、备注、标签、后端计算摘要及其他不支持的字段不写入。这是平台副本，不是完整备份；新版本会生成新的副本。

source: Fastest sample pace
zh_hans: 最快采样配速

source: Fatigue ATL
zh_hans: 疲劳 ATL

source: Finish
zh_hans: 终点

source: First half
zh_hans: 前半程

source: Fitness CTL
zh_hans: 体能 CTL

source: Fitness and fatigue
zh_hans: 体能与疲劳

source: Fitness and fatigue trends
zh_hans: 体能与疲劳趋势

source: Fitness uses 42-day and fatigue uses 7-day exponential decay. These HRSS values cannot be directly compared with other load models.
zh_hans: 体能使用 42 天、疲劳使用 7 天的指数衰减。基于 HRSS，不能与其他负荷模型的数值直接比较。

source: Flight ratio
zh_hans: 腾空比

source: Flight time
zh_hans: 腾空时间

source: Flight time uses cadence and ground contact time. Vertical ratio uses vertical oscillation and step length. Simultaneous valid samples are required.
zh_hans: 腾空时间由步频和触地时间计算，垂直比由垂直振幅和每步步长计算；需要同时存在的有效采样。

source: Grade
zh_hans: 坡度

source: Ground contact time
zh_hans: 触地时间

source: HRSS / day
zh_hans: HRSS / 日

source: Health
zh_hans: 健康

source: Heart rate
zh_hans: 心率

source: Heart rate %lld · Power %lld · Speed %lld · Route %lld
zh_hans: 心率 %lld · 功率 %lld · 速度 %lld · 路线 %lld

source: Heart rate and training load
zh_hans: 心率与训练负荷

source: Heart rate coverage
zh_hans: 心率覆盖率

source: Heart rate load cannot be calculated from the current data
zh_hans: 当前数据无法计算心率负荷

source: Height
zh_hans: 身高

source: Height (cm)
zh_hans: 身高 (cm)

source: History range
zh_hans: 历史范围

source: Horizontal axis
zh_hans: 横轴

source: Horizontal axis: %@ · Vertical axis: minutes. Weighted by covered time, not sample count.
zh_hans: 横轴 %@ · 纵轴分钟。基于有效时间覆盖，不按采样点数量计数。

source: If interrupted, reopen export from this workout to resume. Completion requires both the platform write and the server receipt to be confirmed.
zh_hans: 中途离开后，可从此运动详情重新打开并恢复。仅在平台写入和后端回执都确认后显示完成。

source: If you have CTL / ATL from the same HRSS model, enter the values for the day before this range. A zero start is a calculation assumption that strongly affects short histories.
zh_hans: 若已有同一 HRSS 模型下的 CTL / ATL，可填写范围开始前一天的值。零起点仅是计算假设，短历史会明显受它影响。

source: Import confirmed. Uploading again will not create duplicates.
zh_hans: 已确认导入，重复上传不会新增记录。

source: Import from Apple Health
zh_hans: 从苹果健康导入 AI Fitness

source: Initial fatigue ATL
zh_hans: 初始疲劳 ATL

source: Initial fitness CTL
zh_hans: 初始体能 CTL

source: Initial state
zh_hans: 初始状态

source: Insufficient continuous samples
zh_hans: 连续采样不足

source: Intensity factor
zh_hans: 强度因子

source: Lap %lld
zh_hans: 分段 %lld

source: Light
zh_hans: 浅色

source: Load more
zh_hans: 加载更多

source: Load uses your selected coefficient, without inferring it from your identity. Heart rate zones use heart rate reserve.
zh_hans: 负荷使用你选择的指数；不会根据身份推断。心率区间按心率储备划分。

source: Loading details…
zh_hans: 正在加载详情…

source: Loading settings…
zh_hans: 正在加载设置…

source: Loading workouts…
zh_hans: 正在加载运动…

source: Manage your session on the current server.
zh_hans: 管理当前服务器的登录会话。

source: Maximum
zh_hans: 最大

source: Maximum altitude
zh_hans: 最高海拔

source: Maximum heart rate (bpm)
zh_hans: 最大心率 (bpm)

source: Measurement samples
zh_hans: 测量样本

source: Mechanical work
zh_hans: 机械功

source: Metabolic energy
zh_hans: 代谢能量

source: Metric
zh_hans: 指标

source: Metric · km / kg / W
zh_hans: 公制 · km / kg / W

source: Minimum
zh_hans: 最小

source: Minimum altitude
zh_hans: 最低海拔

source: Minutes
zh_hans: 分钟

source: More summary metrics
zh_hans: 更多摘要指标

source: Moving time
zh_hans: 移动时间

source: Net elevation change
zh_hans: 净海拔变化

source: No data
zh_hans: 无数据

source: No personal parameters were effective at the workout start. Add them in Settings → Personal parameters.
zh_hans: 运动开始时没有生效的个人参数；可在「设置 → 个人身体参数」中添加。

source: No records are available to display. Adjust the dates or check system Health permissions.
zh_hans: 当前没有可显示的记录。可调整日期或在系统健康权限中检查。

source: No records match the current filters.
zh_hans: 当前筛选下没有记录。

source: No route data
zh_hans: 无路线数据

source: No sample data
zh_hans: 无采样数据

source: No samples available for this axis
zh_hans: 没有可用于此横轴的采样

source: No training trend available
zh_hans: 暂无可绘制的训练趋势

source: No valid timer duration
zh_hans: 没有有效计时时间

source: No workouts yet
zh_hans: 暂无运动记录

source: None
zh_hans: 无

source: Normalized power
zh_hans: 标准化功率

source: Observed mechanical work
zh_hans: 观测机械功

source: Only single-sport cycling and running workouts are supported. Multisport workouts are not supported yet.
zh_hans: 目前支持单项骑行或跑步，多项目运动暂不支持。

source: Pace
zh_hans: 配速

source: Parameter revision
zh_hans: 参数版本

source: Password
zh_hans: 密码

source: Personal parameters
zh_hans: 个人身体参数

source: Personal parameters effective from
zh_hans: 个人参数生效时间

source: Power
zh_hans: 功率

source: Power / heart rate decoupling between halves
zh_hans: 前后半程功率 / 心率解耦

source: Power analysis
zh_hans: 功率分析

source: Power connects samples at most 5 seconds apart. Normalized power uses complete 30-second rolling windows; interpret results under 10 minutes cautiously.
zh_hans: 功率计算仅连接相邻 5 秒内的采样。标准化功率使用完整的 30 秒滚动窗口；短于 10 分钟的结果需谨慎解读。

source: Power training stress
zh_hans: 功率训练压力

source: Power zones
zh_hans: 功率区间

source: Preview and confirm
zh_hans: 预览与确认

# Preview selection (%lld)
source: Preview %lld workouts
zh_hans: 预览已选 %lld 条

source: Processing export…
zh_hans: 正在处理导出…

source: Processing…
zh_hans: 正在处理…

source: Record completeness, heart rate coverage or personal parameters are insufficient. This day and subsequent trends remain unknown.
zh_hans: 记录完整性、心率覆盖或个人参数不足，此日及后续趋势保留未知。

source: Record weight, height, and separate power and heart rate thresholds for cycling and running. Leave unknown parameters empty.
zh_hans: 记录体重、身高，以及骑行和跑步各自的功率与心率阈值。缺少的参数可以留空。

source: Recorded distance
zh_hans: 记录距离

source: Recorded samples
zh_hans: 原始采样

source: Recorded summary
zh_hans: 记录摘要

source: Recorded timer events
zh_hans: 记录中的计时事件

source: Recorded workout route
zh_hans: 运动记录路线

source: Refresh linked imported data
zh_hans: 更新已导入的关联数据

source: Refresh workout
zh_hans: 刷新训练

source: Reload
zh_hans: 重新加载

source: Reload details
zh_hans: 重新加载详情

source: Remaining influence of the initial CTL
zh_hans: 起点对当前 CTL 的剩余影响

source: Request ID: %@
zh_hans: 请求标识：%@

source: Resting heart rate (bpm)
zh_hans: 静息心率 (bpm)

source: Restoring sign-in…
zh_hans: 正在恢复登录…

source: Resume the previously confirmed version first, then reopen this page to export the current revision.
zh_hans: 先恢复此前确认的版本，再重新打开此页面导出当前版本。

source: Retire equipment
zh_hans: 停用器材

source: Retired
zh_hans: 已停用

source: Retry
zh_hans: 重试

source: Retry analysis
zh_hans: 重试分析

source: Retry failed import
zh_hans: 重试失败的导入

source: Retry restoring sign-in
zh_hans: 重试恢复登录

source: Revision %@
zh_hans: 版本 %@

source: Route
zh_hans: 路线

source: Route points
zh_hans: 路线点

# Route points: %lld
source: %lld route points
zh_hans: %lld 个位置点

source: Running
zh_hans: 跑步

source: Running cadence
zh_hans: 步频

source: Running dynamics
zh_hans: 跑姿

source: Running effectiveness
zh_hans: 跑步效率

source: Running shoes
zh_hans: 跑鞋

source: Sample coverage meets the requirement
zh_hans: 采样覆盖满足要求

# Samples: %lld
source: %lld samples
zh_hans: %lld 个样本

source: Satellite map
zh_hans: 卫星地图

source: Save
zh_hans: 保存

source: Save to Apple Health
zh_hans: 存入 Apple 健康

source: Saved to this account · Revision %@
zh_hans: 已保存到当前账号 · 版本 %@

source: Saving…
zh_hans: 正在保存…

source: Second half
zh_hans: 后半程

source: Select cycling or running workouts, then review and confirm uploading to the current server.
zh_hans: 选择骑行或跑步，预览后再确认上传到当前服务器。

source: Select the zero-start assumption or enter nonnegative initial CTL and ATL values.
zh_hans: 请选择零起点假设，或填写非负的初始 CTL 和 ATL。

source: Select up to 10 workouts per batch.
zh_hans: 每批最多选择 10 条运动，请分批导入。

source: Select workouts
zh_hans: 选择运动

source: Server
zh_hans: 服务器

source: Server address
zh_hans: 服务器地址

source: Server-calculated summary
zh_hans: 后端计算摘要

source: Settings
zh_hans: 设置

source: Settings are being saved. Try again shortly.
zh_hans: 设置正在保存，请稍后重试。

source: Settings are loading. Try again shortly.
zh_hans: 设置正在加载，请稍后重试。

source: Sign in
zh_hans: 登录

source: Sign in again to save settings.
zh_hans: 请重新登录后保存设置。

source: Sign in to view your workout and health records.
zh_hans: 登录后，继续查看你的运动与健康记录。

source: Sign out
zh_hans: 退出登录

source: Sign-in was cancelled, but the server session could not be revoked. Revoke it later in session management.
zh_hans: 登录已取消，但服务器会话未能撤销；可稍后在会话管理中撤销。

source: Sign-out has not completed. Try again.
zh_hans: 退出尚未完成，请重试。

source: Signing in…
zh_hans: 正在登录…

source: Signing out…
zh_hans: 正在退出…

source: Software settings
zh_hans: 软件设置

source: Speed
zh_hans: 速度

source: Speed change in the second half
zh_hans: 后半程速度变化

source: Split
zh_hans: 分段

source: Split %lld
zh_hans: 第 %lld 段

source: Split length
zh_hans: 分段长度

source: Splits and sensor averages use elapsed time, including stops. Heart rate load uses recorded timer events to exclude pauses when available.
zh_hans: 分段与传感器均值使用经过时间，包含停车。心率负荷优先使用记录中的计时事件排除暂停。

source: Sport
zh_hans: 运动类型

source: Standard map
zh_hans: 标准地图

source: Start
zh_hans: 开始

source: Statistics and distributions are time-weighted, connecting samples at most 120 seconds apart. Zeros are retained; gaps are not filled with zeros.
zh_hans: 统计与分布按时间加权，最多连接相邻 120 秒内的采样。零值保留，空档不补零。

source: Step length
zh_hans: 步长

source: Steps (complete cadence integral)
zh_hans: 步数（完整步频积分）

source: System
zh_hans: 跟随系统

source: TRIMP coefficient
zh_hans: TRIMP 指数

source: The Apple Health write and server receipt are both confirmed.
zh_hans: Apple 健康写入与后端回执均已确认。

source: The Apple Health write has not been confirmed. Unlock this device and allow read access, then retry. The workout will not be written again.
zh_hans: 尚不能确认 Apple 健康的写入结果。请解锁设备并允许读取后重试；不会重复写入。

source: The data has changed. Refresh and try again.
zh_hans: 数据已经变化，请刷新后重试。

source: The effective time must be after the previous parameter record.
zh_hans: 生效时间需要晚于上一条参数记录。

source: The operation was cancelled.
zh_hans: 操作已取消。

source: The preview includes readable samples associated with this workout and from the same source. Missing data are not estimated. Interval samples use their end time; distance and energy accumulate available increments. Step counts are not converted to cadence. Laps, device-specific fields and other sports are not included.
zh_hans: 预览只包含可读取、关联于这条运动且来自同一来源的样本。缺失数据不会补算；区间样本显示在结束时刻，距离和能量累计可用增量。步数不推算为步频。暂不包含圈段、设备专有字段或其他运动类型。

source: The request could not be completed. Try again.
zh_hans: 请求未能完成，请重试。

source: The server could not complete the request. Try again.
zh_hans: 服务器暂时无法完成请求，请重试。

source: The server could not import this data. Existing workouts are unchanged.
zh_hans: 后端未能导入这些数据；已有运动记录保持不变。

source: The server did not return a complete import result. Check again.
zh_hans: 服务器未返回完整导入结果，请重新检查。

source: The server has not confirmed completion. Check again later.
zh_hans: 服务器尚未确认完成，可稍后重新检查。

source: The server requires HTTPS. Development builds allow HTTP only for loopback addresses.
zh_hans: 后端需要使用 HTTPS；开发模式只允许本机地址使用 HTTP。

source: The submitted data is invalid. Check it and try again.
zh_hans: 提交的数据不符合要求，请检查后重试。

source: The username or password is incorrect.
zh_hans: 用户名或密码不正确。

source: The workout has changed. Refresh to view its current power curve.
zh_hans: 训练已更新，请刷新后查看对应的功率曲线。

source: The workout record changed. Reload details.
zh_hans: 运动记录已更新，请重新加载详情。

source: The workout was written, but the route has not been confirmed. Unlock this device and allow read access, then retry.
zh_hans: 运动已写入，但路线结果尚不能确认。请解锁设备并允许读取后重试。

source: Theme
zh_hans: 主题

source: There are not enough continuous power samples to calculate best sustained power.
zh_hans: 没有足够的连续功率采样，无法计算最佳持续功率。

source: These are source-recorded summaries. Metabolic energy and mechanical work are shown separately; missing metrics are not estimated.
zh_hans: 以上保留源记录的摘要，代谢能量与机械功分别展示。没有记录的指标不会用估值补齐。

source: This Apple Health workout cannot be read. Select it again.
zh_hans: 这条苹果健康记录当前不可读取，请重新选择。

source: This action is not allowed.
zh_hans: 当前操作未获允许。

source: This data cannot be safely exported.
zh_hans: 这些数据暂不能安全导出。

source: This data exceeds the server limit and cannot be submitted.
zh_hans: 数据量超过服务器限制，暂时无法提交。

source: This history cannot be calculated. Adjust the analysis options and try again.
zh_hans: 当前历史数据无法计算，请调整分析条件后重试。

source: This history exceeds the processing limit. Choose a shorter date range and try again.
zh_hans: 这段历史的数据量超过处理上限，请缩短日期范围后重试。

source: This list has changed. Pull down to refresh.
zh_hans: 列表分页已失效，请下拉刷新。

source: This record does not exist or was deleted.
zh_hans: 记录不存在或已被删除。

source: This record is excluded from statistics
zh_hans: 此记录不计入统计

source: This source was deleted and blocked from reimporting.
zh_hans: 此来源已被删除并禁止重新导入。

source: This workout contains overlapping or unsupported samples and cannot be fully imported yet.
zh_hans: 此记录含有重叠或无法表示的样本，暂不能完整导入。

source: This workout has too many samples to import.
zh_hans: 此记录的样本过多，暂不支持导入。

source: This workout is being exported. Try again shortly.
zh_hans: 此记录正在导出，请稍后再试。

source: This workout is excluded from statistics
zh_hans: 此运动不计入统计

source: Threshold heart rate (bpm)
zh_hans: 阈值心率 (bpm)

source: Threshold power (W)
zh_hans: 阈值功率 (W)

source: Threshold power used
zh_hans: 使用的阈值功率

source: Time
zh_hans: 时间

source: Time zone
zh_hans: 时区

source: Timer time
zh_hans: 计时时间

source: Timing basis
zh_hans: 计时依据

source: Too many requests. Try again later.
zh_hans: 请求过于频繁，请稍后重试。

source: Total ascent
zh_hans: 累计爬升

source: Total descent
zh_hans: 累计下降

source: Training balance CTL − ATL
zh_hans: 负荷平衡 CTL − ATL

source: Training trends
zh_hans: 训练趋势

source: Type
zh_hans: 类型

source: Units
zh_hans: 单位

source: Unrecorded metrics
zh_hans: 未记录的指标

source: Until %@
zh_hans: 至 %@

source: Update personal parameters
zh_hans: 更新个人参数

source: Username
zh_hans: 用户名

source: Uses elapsed time, including stops. The final split retains its actual distance.
zh_hans: 按经过时间计算，包含停止时间。末段保留实际距离。

source: Valid coverage
zh_hans: 有效覆盖

source: Valid coverage: %@
zh_hans: 有效覆盖 %@

source: Values must be greater than zero. Leave missing data empty.
zh_hans: 数值需要大于零；没有数据时请留空。

source: Variability index
zh_hans: 变异指数

source: Vertical oscillation
zh_hans: 垂直振幅

source: Vertical ratio
zh_hans: 垂直比

# View all splits (%lld)
source: View all %lld splits
zh_hans: 查看全部 %lld 个分段

source: View best power data
zh_hans: 查看最佳功率数据

# View recorded laps (%lld)
source: View %lld recorded laps
zh_hans: 查看 %lld 个记录分段

source: View summary and available data
zh_hans: 查看摘要及可用数据

source: Weight (kg, optional)
zh_hans: 重量 (kg，可选)

source: Welcome back
zh_hans: 欢迎回来

source: What the export includes
zh_hans: 导出包含哪些数据

source: When confirmed, days without workouts count as rest. Otherwise they remain unknown, so missing records are not treated as zero load.
zh_hans: 确认后，没有运动的日子按休息日计算。未确认时保留未知状态，避免把漏记的运动当作零负荷。

source: Workout details
zh_hans: 运动详情

source: Workout equipment
zh_hans: 运动中的器材

source: Workout notes
zh_hans: 运动备注

source: Workout route
zh_hans: 运动路线

source: Workout-recorded weight and threshold take precedence. Training stress, efficiency and decoupling require full coverage; unsupported results show no data.
zh_hans: 源记录中的体重和阈值优先。训练压力、效率和解耦需要完整覆盖；没有依据时显示无数据。

source: Workouts
zh_hans: 运动

source: Write the previewed data to Apple Health?
zh_hans: 确认将预览的数据写入 Apple 健康？

source: Write to Apple Health / Resume export
zh_hans: 写入 Apple 健康 / 恢复导出

source: Your preferences, personal parameters and sports equipment.
zh_hans: 你的偏好、身体参数与运动器材。

source: Your session has expired. Sign in again.
zh_hans: 登录已失效，请重新登录。

source: Zone
zh_hans: 区间
